using System;
using System.IO;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;
using System.Runtime.InteropServices;

namespace WindowsFormsApplication1
{   
    public partial class Form1 : Form
    {
        public Form1()
        {
            InitializeComponent();
        }
        private void оПрограммеToolStripMenuItem_Click(object sender, EventArgs e)
        {
            AboutBox1 o_programme = new AboutBox1();
            o_programme.ShowDialog();
        }

        private void textBox1_MouseClick(object sender, MouseEventArgs e)
        {
            string MALE; string FEMALE;

            string[] MALE_FIRSTNAME_samples = {"Александр", "Алексей", "Аркадий", "Афанасий", "Борис", "Иван", "Николай", "Виталий", "Георгий"};
            string[] MALE_LASTNAME_samples = {"Абрамов", "Авдеев", "Агафонов", "Аксёнов", "Александров", "Алексеев", "Андреев", "Анисимов", "Антонов", "Артемьев", "Архипов", "Афанасьев", "Баранов", "Белов", "Белозёров", "Белоусов", "Беляев", "Беляков", "Беспалов", "Бирюков", "Блинов", "Блохин", "Бобров", "Бобылёв", "Богданов", "Большаков", "Борисов", "Брагин", "Буров", "Быков", "Васильев", "Веселов", "Виноградов", "Вишняков", "Владимиров", "Власов", "Волков", "Воробьёв", "Воронов", "Воронцов", "Гаврилов", "Галкин", "Герасимов", "Голубев", "Горбачёв", "Горбунов", "Гордеев", "Горшков", "Григорьев", "Гришин", "Громов", "Гуляев", "Гурьев", "Гусев", "Гущин", "Давыдов", "Данилов", "Дементьев", "Денисов", "Дмитриев", "Доронин", "Дорофеев", "Дроздов", "Дьячков", "Евдокимов", "Евсеев", "Егоров", "Елисеев", "Емельянов", "Ермаков", "Ершов", "Ефимов", "Ефремов", "Жданов", "Жуков", "Журавлёв", "Зайцев", "Захаров", "Зимин", "Зиновьев", "Зуев", "Зыков", "Иванков", "Иванов", "Игнатов", "Игнатьев", "Ильин", "Исаев", "Исаков", "Кабанов", "Казаков", "Калашников", "Калинин", "Капустин", "Карпов", "Кириллов", "Киселёв", "Князев", "Ковалёв", "Козлов", "Колесников", "Колобов", "Комаров", "Комиссаров", "Кондратьев", "Коновалов", "Кононов", "Константинов", "Копылов", "Корнилов", "Королёв", "Костин", "Котов", "Кошелев", "Красильников", "Крылов", "Крюков", "Кудрявцев", "Кудряшов", "Кузнецов", "Кузьмин", "Кулагин", "Кулаков", "Куликов", "Лаврентьев", "Лазарев", "Лапин", "Ларионов", "Лебедев", "Лихачёв", "Лобанов", "Логинов", "Лукин", "Лыткин", "Макаров", "Максимов", "Мамонтов", "Марков", "Мартынов", "Маслов", "Матвеев", "Медведев", "Мельников", "Меркушев", "Миронов", "Михайлов", "Михеев", "Мишин", "Моисеев", "Молчанов", "Морозов", "Муравьёв", "Мухин", "Мышкин", "Мясников", "Назаров", "Наумов", "Некрасов", "Нестеров", "Никитин", "Никифоров", "Николаев", "Никонов", "Новиков", "Носков", "Носов", "Овчинников", "Одинцов", "Орехов", "Орлов", "Осипов", "Павлов", "Панов", "Панфилов", "Пахомов", "Пестов", "Петров", "Петухов", "Поляков", "Пономарёв", "Попов", "Потапов", "Прохоров", "Рогов", "Родионов", "Рожков", "Романов", "Русаков", "Рыбаков", "Рябов", "Савельев", "Савин", "Сазонов", "Самойлов", "Самсонов", "Сафонов", "Селезнёв", "Селиверстов", "Семёнов", "Сергеев", "Сидоров", "Силин", "Симонов", "Ситников", "Соболев", "Соколов", "Соловьёв", "Сорокин", "Степанов", "Стрелков", "Субботин", "Суворов", "Суханов", "Сысоев", "Тарасов", "Терентьев", "Тетерин", "Тимофеев", "Титов", "Тихонов", "Третьяков", "Трофимов", "Туров", "Уваров", "Устинов", "Фадеев", "Фёдоров", "Федосеев", "Федотов", "Филатов", "Филиппов", "Фокин", "Фомин", "Фомичёв", "Фролов", "Харитонов", "Хохлов", "Цветков", "Чернов", "Шарапов", "Шаров", "Шашков", "Шестаков", "Шилов", "Ширяев", "Шубин", "Щербаков", "Щукин", "Юдин", "Яковлев", "Якушев", "Смирнов"};
            string[] MALE_FATHERNAME_samples = {"Ааронович", "Абрамович", "Августович", "Авдеевич", "Аверьянович", "Адамович", "Адрианович", "Акимович", "Аксёнович", "Александрович", "Алексеевич", "Анатольевич", "Андреевич", "Анисимович", "Антипович", "Антонович", "Ануфриевич", "Аркадьевич", "Арсенович", "Арсеньевич", "Артёмович", "Артемьевич", "Артурович", "Архипович", "Афанасьевич", "Батькович", "Бенедиктович", "Богданович", "Бориславич", "Бориславович", "Борисович", "Борисыч", "Брониславович", "Вадимович", "Валентинович", "Валерианович", "Валерьевич", "Валерьянович", "Васильевич", "Венедиктович", "Вениаминович", "Викентьевич", "Викторович", "Виленович", "Вилорович", "Виссарионович", "Витальевич", "Владиленович", "Владимирович", "Владиславович", "Владленович", "Власович", "Всеволодович", "Вячеславович", "Гавриилович", "Гаврилович", "Гаджиевич", "Геннадиевич", "Геннадьевич", "Генрихович", "Георгиевич", "Герасимович", "Германович", "Гертрудович", "Глебович", "Гордеевич", "Григорьевич", "Гурьевич", "Давидович", "Давыдович", "Даниилович", "Данилович", "Демидович", "Демьянович", "Денисович", "Димитриевич", "Дмитриевич", "Дорофеевич", "Евгеньевич", "Евграфович", "Евдокимович", "Евсеевич", "Евстигнеевич", "Егорович", "Елизарович", "Елисеевич", "Емельянович", "Еремеевич", "Ермилович", "Ермолаевич", "Ерофеевич", "Ефимович", "Ефимьевич", "Ефремович", "Ефстафьевич", "Жанович", "Жоресович", "Захарович", "Захарьевич", "Зиновьевич", "Иванович", "Игнатович", "Игнатьевич", "Игоревич", "Измаилович", "Изотович", "Израилевич", "Иларионович", "Ильгизович", "Ильич", "Ильмирович", "Ильнурович", "Ильсурович", "Ильясович", "Иоаннович", "Иосипович", "Иосифович", "Исаевич", "Исидорович", "Леонидович", "Леонович", "Магомедович", "Магометович", "Макарович", "Максимович", "Маркович", "Матвеевич", "Михайлович", "Натанович", "Наумович", "Никитич", "Никифорович", "Николаевич", "Осипович", "Павлович", "Петрович","Платонович","Прохорович","Ростиславович","Русланович","Семёнович","Сергеевич","Сидорович","Соломонович","Степанович","Тарасович","Теймуразович","Терентьевич","Тимофеевич","Тимурович","Тихонович","Трифонович","Трофимович","Устинович","Фадеевич","Фёдорович","Федосеевич","Федосьевич","Федотович","Феликсович","Феодосьевич","Феоктистович","Феофанович","Филатович","Филимонович","Филиппович","Фокич","Фомич","Фролович","Харитонович","Харламович","Харлампович","Харлампьевич","Чеславович","Эдгардович","Эдгарович","Эдуардович","Юлианович","Юльевич","Юрьевич","Яковлевич","Якубович","Ярославович"};

            string[] FEMALE_FIESTNAME_samples = {"Алена", "Алина", "Ассоль", "Береслава", "Богдана", "Борислава", "Бронислава", "Ванда", "Вера", "Веселина", "Весна", "Голуба", "Горислава", "Дарина", "Дарьяна", "Дидилия", "Доля", "Есения", "Желя", "Забава", "Зарина", "Злата", "Искра", "Июлия", "Лада", "Лукерья", "Любава", "Любовь", "Любомила", "Людмила", "Малуша", "Мила", "Милада", "Милана", "Милена", "Милолика", "Милослава", "Мирослава", "Млада", "Надежда", "Оксана", "Олеся", "Ольга", "Предслава", "Рада", "Радмила", "Радосвета", "Ростислава", "Руда", "Русалина", "Руслана", "Сбыслава", "Светлана", "Снежанна", "Станислава", "Томила", "Цветана", "Чеслава", "Юлиана", "Ярина", "Ярослава"};
            string[] FEMALE_LASTNAME_samples = {"Ковалёва", "Ильина", "Гусева", "Титова", "Кузьмина", "Кудрявцева", "Баранова", "Куликова", "Алексеева", "Степанова", "Яковалева", "Сорокина", "Сергеева", "Романова", "Захарова", "Борисова", "Королева", "Герасимова", "Пономарева", "Григорьева", "Лазарева", "Медведева", "Ершова", "Никитина", "Соболева", "Рябова", "Полякова", "Цветкова", "Данилова", "Жукова", "Фролова", "Журавлева", "Николаева", "Путина", "Молчанова", "Крылова", "Максимова", "Сидорова", "Осипова", "Белоусова", "Федотова", "Дорофеева", "Егорова", "Панина", "Матвеева", "Боброва", "Дмитриева", "Калинина", "Анисимова", "Петухова", "Пугачева", "Антонова", "Тимофеева", "Никифорова", "Веселова", "Филиппова", "Романова", "Маркова", "Большакова", "Суханова", "Миронова", "Александрова", "Коновалова", "Шестакова", "Казакова", "Ефимова", "Денисова", "Громова", "Фомина", "Андреева", "Давыдова", "Мельникова", "Щербакова", "Блинова", "Колесникова", "Иванова", "Смирнова", "Кузнецова", "Попова", "Соколова", "Лебедева", "Козлова", "Новикова", "Морозова", "Петрова", "Волкова", "Соловаьева", "Васильева", "Зайцева", "Павлова", "Семенова", "Голубева", "Виноградова", "Богданова", "Воробьева", "Федорова", "Михайлова", "Беляева", "Тарасова", "Белова", "Комарова", "Орлова", "Киселева", "Макарова", "Андреева" };
            string[] FEMALE_FATHERNAME_samples = {"Александровна", "Андреевна", "Архиповна", "Алексеевна", "Антоновна", "Аскольдовна", "Альбертовна", "Аркадьевна", "Афанасьевна", "Анатольевна", "Артемовна", "Богдановна", "Болеславовна", "Борисовна", "Вадимовна", "Васильевна", "Владимировна", "Валентиновна", "Вениаминовна", "Владиславовна", "Валериевна", "Викторовна", "Вячеславовна", "Геннадиевна", "Георгиевна", "Геннадьевна", "Григорьевна", "Даниловна", "Дмитриевна", "Евгеньевна", "Егоровны", "Егоровна", "Ефимовна", "Ждановна", "Захаровна", "Ивановна", "Игоревна", "Ильинична", "Кирилловна", "Кузминична", "Константиновна", "Кузьминична", "Леонидовна", "Леоновна", "Львовна", "Макаровна", "Матвеевна", "Михайловна", "Максимовна", "Мироновна", "Натановна", "Никифоровна", "Ниловна", "Наумовна", "Николаевна", "Олеговна", "Оскаровна", "Павловна", "Петровна", "Робертовна", "Рубеновна", "Руслановна", "Романовна", "Рудольфовна", "Святославовна", "Сергеевна", "Степановна", "Семеновна", "Станиславовна", "Тарасовна", "Тимофеевна", "Тимуровна", "Федоровна", "Феликсовна", "Филипповна", "Харитоновна", "Эдуардовна", "Эльдаровна", "Юльевна", "Юрьевна", "Яковлевна" };

            int count_names = MALE_FIRSTNAME_samples.Length;
            int count_lastnames = MALE_LASTNAME_samples.Length;
            int count_fathernames = MALE_FATHERNAME_samples.Length;
            int count_names2 = FEMALE_FIESTNAME_samples.Length;
            int count_lastnames2 = FEMALE_LASTNAME_samples.Length;
            int count_fathernames2 = FEMALE_FATHERNAME_samples.Length;

            Random rnd = new Random();
            int rnd_value1 = rnd.Next(0, count_names);
            int rnd_value2 = rnd.Next(0, count_lastnames);
            int rnd_value3 = rnd.Next(0, count_fathernames);
            int rnd_value11 = rnd.Next(0, count_names2);
            int rnd_value22 = rnd.Next(0, count_lastnames2);
            int rnd_value33 = rnd.Next(0, count_fathernames2);

            if ((lastname.Checked == true) && (fathername.Checked == true)) {
                MALE = MALE_FIRSTNAME_samples[rnd_value1] + ' ' + MALE_LASTNAME_samples[rnd_value2] + ' ' + MALE_FATHERNAME_samples[rnd_value3];
                FEMALE = FEMALE_FIESTNAME_samples[rnd_value11] + ' ' + FEMALE_LASTNAME_samples[rnd_value22] + ' ' + FEMALE_FATHERNAME_samples[rnd_value33];
            } else if (lastname.Checked == true) {
                MALE = MALE_FIRSTNAME_samples[rnd_value1] + ' ' + MALE_LASTNAME_samples[rnd_value2];
                FEMALE = FEMALE_FIESTNAME_samples[rnd_value11] + ' ' + FEMALE_LASTNAME_samples[rnd_value22];
            } else if (fathername.Checked == true) {
                MALE = MALE_FIRSTNAME_samples[rnd_value1] + ' ' + MALE_FATHERNAME_samples[rnd_value3];
                FEMALE = FEMALE_FIESTNAME_samples[rnd_value11] + ' ' + FEMALE_FATHERNAME_samples[rnd_value33];
            } else {
                MALE = MALE_FIRSTNAME_samples[rnd_value1];
                FEMALE = FEMALE_FIESTNAME_samples[rnd_value11];
            }

            if (checkBox1.Checked == true) {textBox1.Text = MALE;} else {textBox1.Text = FEMALE;}
            
            Clipboard.SetDataObject(textBox1.Text);
        }

        private void textBox2_MouseClick(object sender, MouseEventArgs e)
        {
            string[] good = {"Ganen", "Aravebba", "Pur", "Teysagudo", "Raleem", "Goweliu", "Bahanh", "Eyanetr", "Nettinau", "Chereide", "Jass", "Jirei", "Xene", "Julw", "Colianee", "Eertan", "Pleas", "Ldanuana", "Lynath", "Ynichiran"};
            string[] bukva = { "A", "B", "C", "D", "F", "G", "K", "L", "M", "N", "Z", "X" };
            string[] version = { "Elite", "Pro", "Standart", "Deluxe", "Profesional" };

            Random rnd2 = new Random();
            int count_goods = good.Length;
            int count_bukva = bukva.Length;
            int count_version = version.Length;

            int rnd_good = rnd2.Next(0, count_goods);
            int rnd_bukva = rnd2.Next(0, count_bukva);
            int rnd_version = rnd2.Next(0, count_version);
            int numer = rnd2.Next(1, 100) * 10;

           if ((bukvaBox.Checked == true) && (versionBox.Checked == true)) { textBox2.Text = good[rnd_good] + ' ' + bukva[rnd_bukva] + numer + ' ' + version[rnd_version]; }
           else if (bukvaBox.Checked == true) { textBox2.Text = good[rnd_good] + ' ' + bukva[rnd_bukva] + numer; }
           else { textBox2.Text = good[rnd_good]; }
           Clipboard.SetDataObject(textBox2.Text);
        }

        private void comboBox1_SelectedIndexChanged(object sender, EventArgs e)
        {
            switch (comboBox1.SelectedIndex)
            {
                case 0: Clipboard.SetDataObject("По любым  вопросам проконсультируйтесь по телефону \n+7(800)333-22-33 или оставьте заявку на сайте.");
                    text_out.Text = "По любым  вопросам проконсультируйтесь по телефону \n+7(800)333-22-33 или оставьте заявку на сайте.";
                    break;
                case 1:
                    Clipboard.SetDataObject("Оставьте заявку на нашем сайте или позвоните по бесплатному телефону +7(800)333-22-33. Наш специалист ответит на все Ваши вопросы!");
                    text_out.Text = "Оставьте заявку на нашем сайте или позвоните по бесплатному телефону +7(800)333-22-33. Наш специалист ответит на все Ваши вопросы!";
                    break;
                case 2:
                    Clipboard.SetDataObject("Специальное предложение! Оставьте заявку на нашем сайте прямо сейчас и получите промокод на 500 рублей! Спешите!");
                    text_out.Text = "Специальное предложение! Оставьте заявку на нашем сайте прямо сейчас и получите промокод на 500 рублей! Спешите!";
                    break;
                case 3:
                    Clipboard.SetDataObject("Спеицальное предложение! Оставьте заявку на сайте прямо сейчас и получите 20% скидку на весь ассортимент!");
                    text_out.Text = "Спеицальное предложение! Оставьте заявку на сайте прямо сейчас и получите 20% скидку на весь ассортимент!";
                    break;
                case 4:
                    Clipboard.SetDataObject("Все заказы отправляются после подтверждения менеджером, с понедельника по пятницу с 10-00 до 18-00 по МСК времени.\n\nТовар отправляется: курьерскими компаниями, почтой России или самовывозом. Сроки доставки зависят от удаленности Вашего региона от центральной части России. Курьерская доставка срок от 3 до 7 дней. Почтой России срок от 7 дней.​​​​​​​\n\nПри заказе на сумму более 20 000 рублей доставка осуществляется совершенно бесплатно!");
                    text_out.Text = "Все заказы отправляются после подтверждения менеджером, с понедельника по пятницу с 10-00 до 18-00 по МСК времени.\n\nТовар отправляется: курьерскими компаниями, почтой России или самовывозом. Сроки доставки зависят от удаленности Вашего региона от центральной части России. Курьерская доставка срок от 3 до 7 дней. Почтой России срок от 7 дней.​​​​​​​\n\nПри заказе на сумму более 20 000 рублей доставка осуществляется совершенно бесплатно!";
                    break;
                case 5:
                    Clipboard.SetDataObject("Для вашего удобства мы принимаем следующие способы оплаты:\n\t— Наличные;\n\t— Безналичный расчет;\n\t— Электронные деньги (QIWI, Pay Pal, WebMoney).\nОплата заказа по безналичному расчету: После подтверждения заказа менеджером, для оплаты на расчетный счет, Вам выставят счет с реквизитами компании.Счет можно оплатить в банке через оператора.Если у вас есть банк - клиент, то оплачиваете заказ через него.");
                    text_out.Text = "Для вашего удобства мы принимаем следующие способы оплаты:\n\t— Наличные;\n\t— Безналичный расчет;\n\t— Электронные деньги (QIWI, Pay Pal, WebMoney).\nОплата заказа по безналичному расчету: После подтверждения заказа менеджером, для оплаты на расчетный счет, Вам выставят счет с реквизитами компании.Счет можно оплатить в банке через оператора.Если у вас есть банк - клиент, то оплачиваете заказ через него.";
                    break;
                case 6:
                    Clipboard.SetDataObject("Адрес: г. Москва, ул. Центральная 1, офис 100\nТелефон: +7(800)333 - 22 - 33\nЭлектронный адрес: info@tobiz.net\nГрафик работы: с 08:00 до 20:00(пон - пят), с 09:00 до 14:00(суб)");
                    text_out.Text = "Адрес: г. Москва, ул. Центральная 1, офис 100\nТелефон: +7(800)333 - 22 - 33\nЭлектронный адрес: info@tobiz.net\nГрафик работы: с 08:00 до 20:00(пон - пят), с 09:00 до 14:00(суб)";
                    break;
            }
        }

        private void button2_Click(object sender, EventArgs e)
        {
            text_out.Text = text_out.Text.ToUpper();
        }

        private void button1_Click(object sender, EventArgs e)
        {
            text_out.Text = text_out.Text.ToLower();
        }

        private void началоРаботыToolStripMenuItem_Click(object sender, EventArgs e)
        {
            System.Diagnostics.Process.Start("https://tobiz.net/");
        }

        private void выходToolStripMenuItem_Click(object sender, EventArgs e)
        {
            Application.Exit();
        }

        private void фотобанкPxhereToolStripMenuItem_Click(object sender, EventArgs e)
        {
            System.Diagnostics.Process.Start("https://pxhere.com");
        }

        private void фотобанкPxbayToolStripMenuItem_Click(object sender, EventArgs e)
        {
            System.Diagnostics.Process.Start("https://pixabay.com/");
        }

        private void проверкаТекстовToolStripMenuItem_Click(object sender, EventArgs e)
        {
            System.Diagnostics.Process.Start("https://text.ru");
        }

        private void рабочаяПапкаToolStripMenuItem_Click(object sender, EventArgs e)
        {
            string path = Directory.GetCurrentDirectory();
            path.Replace("\\", "/");
            System.Diagnostics.Process.Start(path);
        }
    }
}
